"""
4.Робота світлофора для водіїв запрограмована таким чином: на початку кожної
години протягом трьох хвилин горить зелений сигнал, потім протягом однієї хвилини -
жовтий, протягом двох хвилин - червоний, протягом трьох хвилин - знову зелений і т. д.
Розробити програму, яка вводить дійсне число t, що означає час в хвилинах, що
минув з початку чергової години і визначає сигнал якого кольору горить для водіїв в цей
момент.
"""
while True:
    while True:
        try:
            t = int(input('Введіть хвилиноньку: '))
            break
        except ValueError:
            print('ВІДРАХОВАНО')
    if (t % 6) < 3:
        print("ЗЕЛЕНИЙ, ЯК КРОПИВА")
    elif (t % 6) == 3:
        print("ЖОВТИЙ, ЯК ОПАЛЕ ОСІННЄ ЛИСТЯ")
    else:
        print("ЧЕРВОНИЙ, МОВ ТА КАЛИНА")

    kek = input("Для повторення операції введіть що-небудь, нічого - завершення операції")
    if len(kek) >= 1:
        continue
    break
